Revit 2024 API
BuiltInFailures.SiteFailures.SurfaceSplitError Property
 The splitting boundary must split the Surface into exactly two pieces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SurfaceSplitError { get; }
Visual Basic
Public Shared ReadOnly Property SurfaceSplitError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SurfaceSplitError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace